Autodesk.Revit.DB.FloorType.ThermalProperties
The calculated and settable thermal properties of the FloorType
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
the floor does not have thermal properties.
Since:
2013

Autodesk.Revit.DB.FloorType.StructuralMaterialId
Returns the identifier of the material that defines the element's structural analysis properties.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: the floor does not have a structural material
Since:
2014

Autodesk.Revit.DB.FloorType.IsFoundationSlab
Returns whether the element FloorAttributes type is FoundationSlab.

Autodesk.Revit.DB.FloorType
An object that specifies the type of a floor in Autodesk Revit.
Remarks:
The structural layers of the floor can be accessed via this object.